# # # # # # # # # # # # # # # # # # # #산술연산식 
# # # # # # # # # # # # # # # # # # # #
# # # # # # # # # # # # # # # # # # # print(123+123)
# # # # # # # # # # # # # # # # # # # print(542-242)
# # # # # # # # # # # # # # # # # # # print(2*123)
# # # # # # # # # # # # # # # # # # # print(120/3)
# # # # # # # # # # # # # # # # # # print("덧셈 결과 : ", 123+123)
# # # # # # # # # # # # # # # # # # print("뺄셈 결과 : ", 542-242)
# # # # # # # # # # # # # # # # # # print("곱셈 결과", 2*123)
# # # # # # # # # # # # # # # # # # print("나눗셈 결과", 120/3)
# # # # # # # # # # # # # # # # # print("12 + 54=", 12+54, "입니다")
# # # # # # # # # # # # # # # # # print("268 - 42=",268-42, "입니다")
# # # # # # # # # # # # # # # # # print("2 * 23=", 2*23,"입니다")
# # # # # # # # # # # # # # # # # print("120 / 3=",120/3 ,"입니다")
# # # # # # # # # # # # # # # # print(0b01111011)
# # # # # # # # # # # # # # # # print(0o173)
# # # # # # # # # # # # # # # # print(0x7b)
# # # # # # # # # # # # # # # # print(123)
# # # # # # # # # # # # # # # print("2진수",bin(0b01111011))
# # # # # # # # # # # # # # # print("8진수",oct(0b01111011))
# # # # # # # # # # # # # # # print("16진수",hex(0b01111011))
# # # # # # # # # # # # # # # print("10진수",0b01111011)
# # # # # # # # # # # # # # #서식문자
# # # # # # # # # # # # # # print("%d" % 123)
# # # # # # # # # # # # # # #print("%d %d" % 123) #TypeError: not enough arguments for format string
# # # # # # # # # # # # # # #print(" %d " % (123, 321)) #TypeError: not all arguments converted during string formatting
# # # # # # # # # # # # # # print("%d %d " % (123, 321))
# # # # # # # # # # # # # # print("%d + %d = %d" % (123, 321, 123+321))
# # # # # # # # # # # # # print(" 10진 정수 : %d" % 123)
# # # # # # # # # # # # # print(" 10진 정수 : %d" % 0o173)
# # # # # # # # # # # # # print(" 10진 정수 : %d" % 0x7b)
# # # # # # # # # # # # # print(" 8진 정수 : %o" % 123)
# # # # # # # # # # # # # print(" 8진 정수 : %o" % 0o173)
# # # # # # # # # # # # # print(" 8진 정수 : %o" % 0x7b)
# # # # # # # # # # # # # print(" 16진 정수 : %x" % 123)
# # # # # # # # # # # # # print(" 16진 정수 : %x" % 0o173)
# # # # # # # # # # # # # print(" 16진 정수 : %x" % 0x7b)
# # # # # # # # # # # # print("정수 표현 : %d" % 123)
# # # # # # # # # # # # print("정수 표현 : %d" % 123.123)
# # # # # # # # # # # # print("정수 표현 : %d %d" % (123,456))
# # # # # # # # # # # # print("\n실수 표현 : %f" % 456)
# # # # # # # # # # # # print("실수 표현 : %f" % 456.456)
# # # # # # # # # # # # print("실수 표현 : %f %f" % (456.456, 123.123))
# # # # # # # # # # # print("문자 표현 : %s %c" % ("한","글"))
# # # # # # # # # # # print("문자 표현 : %c %c" % ("표","현"))
# # # # # # # # # # # print("\n 문자열 표현 : %s" % "안녕")
# # # # # # # # # # # print(" 문자열 표현 : %s\t%s" % ("문자열",'표현방식'))
# # # # # # # # # # print("기본 값 : %d" % 123)
# # # # # # # # # # print("설정 값 : %5d" % 123)
# # # # # # # # # # print("설정 값 : %05d" % 123)
# # # # # # # # # # print("설정 값 : %5d%5d" % (123,123))
# # # # # # # # # # print("설정 값 : %-5d%-5d" % (123,123))
# # # # # # # # # # \t와 %4d의 차이점
# # # # # # # # # # - \t는 무조건 8칸을 확보 / 서식제어문은 칸 수 확보를 지정할 수 있다
# # # # # # # # # # - \t는 무조건 좌측끝정렬 / 서식제어문은 왼쪽 오른쪽 끝정렬을 지정 할 수 있다
# # # # # # # # # # - \t는 8칸을 모두 채우거나 넘치면 다시 8칸을 재확보하지만 / 서식제어문은 무시한다
# # # # # # # # # print("기본 값 :%f" % 123.45678)
# # # # # # # # # print("설정 값 :%10.3f" % 123.45678)
# # # # # # # # # print("설정 값 :%2.1f" % 123.45678)
# # # # # # # # # print("설정 값 :%.2f" % 123.45678)
# # # # # # # # # %A.Bf -> A는 소숫점을 포함한 전체 칸 확보를 의미.B는 표현할 소수자리를 지정
# # # # # # # # #단, 지정한 소수자리를 표현할 때 마지막 자리수에서 반올림처리된다.
# # # # # # # # print("기본 값 :%s" % "python test")
# # # # # # # # print("설정 값 :%20s" % "python test")
# # # # # # # print("-.제어문자를 이용하여 출력하도록 작성")
# # # # # # # print("")
# # # # # # # print("="*10,"출력 결과","="*10)
# # # # # # # print("%s :%s" % ("이름","홍길동"))
# # # # # # # print("%s :%s" % ("나이","20"))
# # # # # # # print("%s :%d" % ("나이",20))
# # # # # # # print("%s %s%d" % ("나이",":",20))
# # # # # # # print("%s%s%s%d" % ("나이"," ",":",20))
# # # # # # # print("%s%s%s%s" % ("나이"," ",":","20"))
# # # # # # # print("%s :%s" % ("Tel","010-1234-1234"))
# # # # # # # print("%s :%s-%s-%s" % ("Tel","010","1234","1234"))
# # # # # # # print("%s :%s-%d-%d" % ("Tel","010",1234,1234))
# # # # # # # print("%s :%s-%s-%d" % ("Tel","010","1234",1234))
# # # # # # # print("%s :%s-%d-%s" % ("Tel","010",1234,"1234"))
# # # # # # # print("%s%s:%s-%s-%s" % ("Tel"," ","010","1234",'1234'))
# # # # # # # print("%s%s%s%s-%d-%d" % ("Tel"," ",":","010",1234,1234))
# # # # # # # print("%s :%.1f" % ("키",178.5))
# # # # # # # print("%s%s:%.1f" % ("키"," ",178.5))
# # # # # # # print("%s%s%s%.1f" % ("키"," ",":",178.5))
# # # # # # # print("%s :%d" % ("몸무게",75))
# # # # # # # print("%s :%s" % ("몸무게","75"))
# # # # # # # print("%s%s%s%d" % ("몸무게"," ",":",75))
# # # # # # # print("%s%s:%s" % ("혈액형"," ","O"))
# # # # # # # print("%s%s%s%s" % ("혈액형"," ",":","O"))
# # # # # # # print("%s %s%s" % ("혈액형",":","O"))
# # # # # # #변수명작명규칙
# # # # # # #변수의 이름은 알파벳, 숫자, 언더바로 구성
# # # # # # #대소문자 구분
# # # # # # #변수의 이름은 숫자로 시작할 수 없음
# # # # # # #키워드는 변수 이름으로 사용 불가능
# # # # # # #공백이나 특수 기호는 포함될 수 없음
# # # # # # #예약어
# # # # # # #프로그래밍 언어 중에서 의미가 고정되어 있고, 사용자가 작성하는 프로그램 상태에 
# # # # # # # 따라서 의미를 변경할 수 없는 단어
# # # # # # # 변수의 작명 요령 (요령이므로 안지켜도 에러가 나지는 않음)
# # # # # # # - 변수는 누가봐도 어떠한 데이터를 저장하는지 또는 어떤 역할을 하는지 
# # # # # # # 쉽게 연상될 수 있도학 지어주는 것이 바람직하다 (이름 -> name, 나이 -> age)
# # # # # # #한글변수는 사용가능하다. 하지만 한글변수는 가급적 사용하지 말자
# # # # # # #대입변수
# # # # # # num = 100
# # # # # # print("정수 형 변수 사용 : %d" % num)
# # # # # # print("정수 형 변수 사용 :", num)
# # # # # num = 5
# # # # # print("변경 전 num :",num)
# # # # # num = num + 10
# # # # # print("변경 후 num :", num)
# # # # num1 = 5
# # # # num2 = 10
# # # # sum_ = num1+num2
# # # # print("id num1 : ",id(num1))
# # # # print("id num2 : ",id(num2))
# # # # print("id sum_ : ",id(sum_))
# # # #id라는 함수는 변수가 메모리에 할당받은 주소 정보이다
# # # #데이터를 가공하는데에는 전혀 영향을 주지 않는다(c언어의 포인터와 다름)
# # # #다만 메모리상에 같은 데이터인지 다른 데이터인지 구분하는 용도로 사용됨
# # # num1 = 10
# # # num2 = 20
# # # num3 = 30
# # # print("num1(%d) + num2(%d) = %d" % (num1, num2, num3))
# # num1 = 7
# # num2 = 5
# # nump = num1 + num2
# # numm = num1 - num2
# # nummu = num1*num2
# # nums = num1 / num2
# # print(num1,"\n",num2,"\n",nump,"\n",numm,"\n",nummu,"\n",nums)
# # print(num1 + num2)
# # print(num1-num2)
# # print(num1*num2)
# # print(num1/num2)
# python = 100
# age = 27
# mypy = 80
# myc = 100
# myjava = 90
# mypycjava = mypy + myc + myjava
# mypycjavapg = mypycjava / 3
# print("파이썬 %d점" % python)
# print("나는 %d살이다" % age)
# print("Python, C, Java 3과목의 점수 합계는 %d점입니다" % mypycjava)
# print("Python, C, Java 3과목의 평균은 %d점입니다" % mypycjavapg)
'''asdfsadfasdfasdf'''